; RUN: %seadsa  %butd_dsa --sea-dsa-dot %s --sea-dsa-lazy-mem-transfer --sea-dsa-stats --sea-dsa-type-aware --sea-dsa-dot-outdir=%T/test-delay-memcpy2.ll
; RUN: %cmp-graphs %tests/test-delay-memcpy2.ll.main.mem.dot %T/test-delay-memcpy2.ll/main.mem.dot | OutputCheck %s -d --comment=";"
; CHECK: ^OK$

; ModuleID = 'test-delay-memcpy2.ll'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.person = type { i8*, i32 }
%struct.byte_buf = type { i32, i32, i8* }
%struct.User = type { i32, %struct.person, %struct.Profile*, i32 }
%struct.Profile = type { i32, %struct.User* }
%struct.double_array = type { i32, [0 x i32] }

@.str = private unnamed_addr constant [5 x i8] c"John\00", align 1
@__const.main.destination2 = private unnamed_addr constant [3 x i32] [i32 1, i32 2, i32 3], align 4
@.str.1 = private unnamed_addr constant [4 x i8] c"%d \00", align 1
@.str.2 = private unnamed_addr constant [6 x i8] c"Alice\00", align 1

; Function Attrs: nounwind uwtable
define dso_local i32 @main() local_unnamed_addr #0 !dbg !44 {
.peel.begin34:
  %0 = alloca i64, align 8
  %1 = alloca i64, align 8
  %2 = alloca i64, align 8
  %3 = alloca i64, align 8
  %4 = alloca i64, align 8
  %5 = alloca i64, align 8
  %6 = alloca i64, align 8
  %7 = alloca %struct.person, align 8
  %8 = alloca %struct.person, align 8
  %9 = alloca [3 x i32], align 4
  %10 = alloca [3 x i32], align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !2, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "/home/ljgy/Works/seatools/taint-benchs/benchmarks/field/field9/field9.c", directory: "/home/ljgy/Works/seatools/taint-benchs/build/benchmarks/field/field9", checksumkind: CSK_MD5, checksum: "0ae7829c0b42401c118b7290e1b507fe")
!2 = !{!3}
!3 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!4 = distinct !DICompileUnit(language: DW_LANG_C99, file: !5, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !6, splitDebugInlining: false, nameTableKind: None)
!5 = !DIFile(filename: "/home/ljgy/Works/seatools/taint-benchs/lib/nd_clam.c", directory: "/home/ljgy/Works/seatools/taint-benchs/build/lib", checksumkind: CSK_MD5, checksum: "a3e9bf8d46f9e3f9034b51583e568cfb")
!6 = !{!7, !10, !15, !18, !21, !3, !14}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !8, line: 46, baseType: !9)
!8 = !DIFile(filename: "/usr/lib/llvm-14/lib/clang/14.0.0/include/stddef.h", directory: "", checksumkind: CSK_MD5, checksum: "2499dd2361b915724b073282bea3a7bc")
!9 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !11, line: 24, baseType: !12)
!11 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-uintn.h", directory: "", checksumkind: CSK_MD5, checksum: "2bf2ae53c58c01b1a1b9383b5195125c")
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !13, line: 38, baseType: !14)
!13 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "d108b5f93a74c50510d7d9bc0ab36df9")
!14 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !11, line: 25, baseType: !16)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !13, line: 40, baseType: !17)
!17 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !11, line: 26, baseType: !19)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !13, line: 42, baseType: !20)
!20 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !11, line: 27, baseType: !22)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !13, line: 45, baseType: !9)
!23 = distinct !DICompileUnit(language: DW_LANG_C99, file: !24, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !25, splitDebugInlining: false, nameTableKind: None)
!24 = !DIFile(filename: "/home/ljgy/Works/seatools/taint-benchs/lib/sea_allocators.c", directory: "/home/ljgy/Works/seatools/taint-benchs/build/lib", checksumkind: CSK_MD5, checksum: "195a095d3b3f671498f7ab8158e09f3f")
!25 = !{!26}
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!27 = distinct !DICompileUnit(language: DW_LANG_C99, file: !28, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !29, splitDebugInlining: false, nameTableKind: None)
!28 = !DIFile(filename: "/home/ljgy/Works/seatools/taint-benchs/lib/clam_taint.c", directory: "/home/ljgy/Works/seatools/taint-benchs/build/lib", checksumkind: CSK_MD5, checksum: "b6c78d8c3355cb659d9cac7f416aa168")
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !3, size: 64)
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!32 = distinct !DICompileUnit(language: DW_LANG_C99, file: !33, producer: "Ubuntu clang version 14.0.0-1ubuntu1.1", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !34, splitDebugInlining: false, nameTableKind: None)
!33 = !DIFile(filename: "/home/ljgy/Works/seatools/taint-benchs/lib/lib_func.c", directory: "/home/ljgy/Works/seatools/taint-benchs/build/lib", checksumkind: CSK_MD5, checksum: "889ddfbf93ec8cf966ffe2347537d028")
!34 = !{!35}
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!37 = !{!"Ubuntu clang version 14.0.0-1ubuntu1.1"}
!38 = !{i32 7, !"Dwarf Version", i32 5}
!39 = !{i32 2, !"Debug Info Version", i32 3}
!40 = !{i32 1, !"wchar_size", i32 4}
!41 = !{i32 7, !"PIC Level", i32 2}
!42 = !{i32 7, !"PIE Level", i32 2}
!43 = !{i32 7, !"uwtable", i32 1}
!44 = distinct !DISubprogram(name: "main", scope: !45, file: !45, line: 45, type: !46, scopeLine: 45, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !49)
!45 = !DIFile(filename: "benchmarks/field/field9/field9.c", directory: "/home/ljgy/Works/seatools/taint-benchs", checksumkind: CSK_MD5, checksum: "0ae7829c0b42401c118b7290e1b507fe")
!46 = !DISubroutineType(types: !47)
!47 = !{!48}
!48 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!49 = !{!50, !55, !56, !60, !62, !63, !64, !73, !75, !77, !78, !80, !86, !88, !89, !102, !103}
!50 = !DILocalVariable(name: "person1", scope: !44, file: !45, line: 47, type: !51)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "person", file: !45, line: 14, size: 128, elements: !52)
!52 = !{!53, !54}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !51, file: !45, line: 15, baseType: !30, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "age", scope: !51, file: !45, line: 16, baseType: !48, size: 32, offset: 64)
!55 = !DILocalVariable(name: "person2", scope: !44, file: !45, line: 51, type: !51)
!56 = !DILocalVariable(name: "source", scope: !44, file: !45, line: 56, type: !57)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 96, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 3)
!60 = !DILocalVariable(name: "i", scope: !61, file: !45, line: 57, type: !48)
!61 = distinct !DILexicalBlock(scope: !44, file: !45, line: 57, column: 3)
!62 = !DILocalVariable(name: "destination", scope: !44, file: !45, line: 61, type: !57)
!63 = !DILocalVariable(name: "destination2", scope: !44, file: !45, line: 63, type: !57)
!64 = !DILocalVariable(name: "darr1", scope: !44, file: !45, line: 65, type: !65)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "double_array", file: !45, line: 19, size: 32, elements: !67)
!67 = !{!68, !69}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !66, file: !45, line: 20, baseType: !48, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "arr", scope: !66, file: !45, line: 21, baseType: !70, offset: 32)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: -1)
!73 = !DILocalVariable(name: "old_array", scope: !44, file: !45, line: 69, type: !74)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!75 = !DILocalVariable(name: "i", scope: !76, file: !45, line: 70, type: !48)
!76 = distinct !DILexicalBlock(scope: !44, file: !45, line: 70, column: 3)
!77 = !DILocalVariable(name: "new_array", scope: !44, file: !45, line: 73, type: !74)
!78 = !DILocalVariable(name: "i", scope: !79, file: !45, line: 76, type: !48)
!79 = distinct !DILexicalBlock(scope: !44, file: !45, line: 76, column: 3)
!80 = !DILocalVariable(name: "buf1", scope: !44, file: !45, line: 81, type: !81)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "byte_buf", file: !45, line: 26, size: 128, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !81, file: !45, line: 27, baseType: !48, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !81, file: !45, line: 28, baseType: !48, size: 32, offset: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !81, file: !45, line: 29, baseType: !30, size: 64, offset: 64)
!86 = !DILocalVariable(name: "i", scope: !87, file: !45, line: 85, type: !48)
!87 = distinct !DILexicalBlock(scope: !44, file: !45, line: 85, column: 3)
!88 = !DILocalVariable(name: "buf2", scope: !44, file: !45, line: 88, type: !81)
!89 = !DILocalVariable(name: "user1", scope: !44, file: !45, line: 96, type: !90)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "User", file: !45, line: 33, size: 320, elements: !91)
!91 = !{!92, !93, !94, !101}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "user_id", scope: !90, file: !45, line: 34, baseType: !48, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "personal_info", scope: !90, file: !45, line: 35, baseType: !51, size: 128, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "profile", scope: !90, file: !45, line: 36, baseType: !95, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Profile", file: !45, line: 40, size: 128, elements: !97)
!97 = !{!98, !99}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "profile_id", scope: !96, file: !45, line: 41, baseType: !48, size: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "owner", scope: !96, file: !45, line: 42, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "post_count", scope: !90, file: !45, line: 37, baseType: !48, size: 32, offset: 256)
!102 = !DILocalVariable(name: "profile1", scope: !44, file: !45, line: 101, type: !96)
!103 = !DILocalVariable(name: "user2", scope: !44, file: !45, line: 106, type: !90)
!104 = !DILocation(line: 47, column: 3, scope: !44)
!105 = !DILocation(line: 47, column: 17, scope: !44)
!106 = !DILocation(line: 48, column: 11, scope: !44)
!107 = !DILocation(line: 48, column: 16, scope: !44)
!108 = !{!109, !110, i64 0}
!109 = !{!"person", !110, i64 0, !113, i64 8}
!110 = !{!"any pointer", !111, i64 0}
!111 = !{!"omnipotent char", !112, i64 0}
!112 = !{!"Simple C/C++ TBAA"}
!113 = !{!"int", !111, i64 0}
!114 = !DILocation(line: 49, column: 11, scope: !44)
!115 = !DILocation(line: 49, column: 15, scope: !44)
!116 = !{!109, !113, i64 8}
!117 = !DILocation(line: 51, column: 3, scope: !44)
!118 = !DILocation(line: 51, column: 17, scope: !44)
!119 = !DILocation(line: 0, scope: !120, inlinedAt: !130)
!120 = distinct !DISubprogram(name: "memcpy", scope: !121, file: !121, line: 31, type: !122, scopeLine: 31, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !32, retainedNodes: !124)
!121 = !DIFile(filename: "lib/lib_func.c", directory: "/home/ljgy/Works/seatools/taint-benchs", checksumkind: CSK_MD5, checksum: "889ddfbf93ec8cf966ffe2347537d028")
!122 = !DISubroutineType(types: !123)
!123 = !{!26, !26, !35, !7}
!124 = !{!125, !126, !127, !128}
!125 = !DILocalVariable(name: "dst", arg: 1, scope: !120, file: !121, line: 31, type: !26)
!126 = !DILocalVariable(name: "src", arg: 2, scope: !120, file: !121, line: 31, type: !35)
!127 = !DILocalVariable(name: "len", arg: 3, scope: !120, file: !121, line: 31, type: !7)
!128 = !DILocalVariable(name: "__sea_is_not_tainted_ptr", scope: !129, file: !121, line: 34, type: !35)
!129 = distinct !DILexicalBlock(scope: !120, file: !121, line: 34, column: 3)
!130 = distinct !DILocation(line: 52, column: 3, scope: !44)
!131 = !{!132, !132, i64 0}
!132 = !{!"long", !111, i64 0}
!133 = !DILocation(line: 33, column: 3, scope: !120, inlinedAt: !130)
!134 = !DILocation(line: 0, scope: !129, inlinedAt: !130)
!135 = !DILocation(line: 34, column: 3, scope: !129, inlinedAt: !130)
!136 = !DILocation(line: 38, column: 37, scope: !120, inlinedAt: !130)
!137 = !DILocation(line: 38, column: 10, scope: !120, inlinedAt: !130)
!138 = !DILocation(line: 38, column: 3, scope: !120, inlinedAt: !130)
!139 = !DILocation(line: 53, column: 11, scope: !44)
!140 = !DILocation(line: 53, column: 15, scope: !44)
!141 = !DILocation(line: 56, column: 3, scope: !44)
!142 = !DILocation(line: 56, column: 7, scope: !44)
!143 = !DILocation(line: 0, scope: !61)
!144 = !DILocation(line: 58, column: 5, scope: !145)
!145 = distinct !DILexicalBlock(scope: !146, file: !45, line: 57, column: 31)
!146 = distinct !DILexicalBlock(scope: !61, file: !45, line: 57, column: 3)
!147 = !DILocation(line: 58, column: 15, scope: !145)
!148 = !{!113, !113, i64 0}
!149 = !DILocation(line: 58, column: 19, scope: !145)
!150 = !DILocation(line: 57, column: 21, scope: !146)
!151 = !DILocation(line: 57, column: 3, scope: !61)
!152 = distinct !{!152, !151, !153, !154, !155, !156}
!153 = !DILocation(line: 59, column: 3, scope: !61)
!154 = !{!"llvm.loop.mustprogress"}
!155 = !{!"llvm.loop.unroll.disable"}
!156 = !{!"llvm.loop.peeled.count", i32 1}
!157 = !DILocation(line: 61, column: 3, scope: !44)
!158 = !DILocation(line: 61, column: 7, scope: !44)
!159 = !DILocation(line: 0, scope: !120, inlinedAt: !160)
!160 = distinct !DILocation(line: 62, column: 3, scope: !44)
!161 = !DILocation(line: 33, column: 3, scope: !120, inlinedAt: !160)
!162 = !DILocation(line: 0, scope: !129, inlinedAt: !160)
!163 = !DILocation(line: 34, column: 3, scope: !129, inlinedAt: !160)
!164 = !DILocation(line: 38, column: 37, scope: !120, inlinedAt: !160)
!165 = !DILocation(line: 38, column: 10, scope: !120, inlinedAt: !160)
